using Tasks.Common;

namespace Task23.Settlements;

[Task(23, "Населенные пункты (хеширование)")]
public class SettlementsSolution : ISettlementsSolution
{
    public static readonly string[] ArrTowns =
    {
        "Антипово", "Батецкий", "Батецко", "Бахарево ", "Белая", "Большие Ясковицы", "Большое Войново", "Большой Волок", "Большой Латовец", "Большой Теребец", "Большой Удрай", "Бор", "Борки", "БОРОК", "Брод", "Будыни", "Велеши", "Витцы", "Вольная Горка", "Воронино", "Вороново", "Вяжищи", "Гастухово", "Глухово", "Глухой Бережок", "Голешино", "Головская", "ГОРОДНЯ", "Григорево", "Дедино", "ДОРОГОБУЖ", "Дорогони", "Дрегла", "Дубровка", "Жабино", "Жегжичино", "Жестяная Горка", "Жили", "Жилой Бережок", "Заосье", "Заполье", "Заречная", "Заупора", "Змеева Гора", "Ивня", "Илемцы", "Клобучи", "Корокса", "Косицкое", "Кострони", "Кочино", "Кошельково", "Красовицы", "Кромы", "Крючково", "Курино", "Кчера", "Кшева", "Лапушицы", "Лежно", "Лихарева Горка", "Лужки", "Любенец", "Любеховичи", "Любино Поле", "Люболяды", "Малое Войново", "Малые Торошковичи", "Малые Ясковицы", "Малый Латовец", "Малый Теребец", "Малый Удрай", "Марьино", "Мелковичи", "МОЙКА", "Мроткино", "Мячино", "Нежатицы", "Некрасово", "Несуж", "Нехино", "Нива", "Новоселок", "Новые Гусины", "Обколи", "Овсино", "Огурково", "Ожогин Волочек", "Озерово", "Остров", "Островище", "Оттурицы", "Очно", "Передки", "Передольская", "Погост-Сабле", "Подберезье", "Подборовье", "Подгорье", "ПОКРОВКА", "ПРЕОБРАЖЕНКА", "Пустошка", "Раглицы", "Радгостицы", "Раджа", "Радовеж", "Радоли", "Редбуж", "Речка", "Русыня", "Светлая", "Селище", "Село Михайловское", "Сельцо", "Середогощь", "Скачели", "Смыч", "Старое Голубково", "Старые Гусины", "Столбец", "Страшево", "Танина Гора", "Теребеник", "Теребони", "Терехани", "Толчино", "Торошино", "Торчиново", "Уномерь", "Уношковичи", "Хвостец", "Холохно", "Хотобужи", "Хочени", "Хочуни", "Хрепле", "Хрипцы", "Черная", "Черновицы", "Черное", "Щепино", "Щепы", "Яковлева Горка"
    };

    public void Run()
    {
        int collisions;
        string[] table = BuildTable(ArrTowns, out collisions);
        Console.WriteLine("Количество коллизий: " + collisions);
        Console.WriteLine("Значение элемента с индексом 4: " + table[4]);
    }

    public static int GetHash(string strS)
    {
        int res = 0;
        foreach (char c in strS)
            res += c;
        res = res % 256;
        return res;
    }


    public string[] BuildTable(string[] towns, out int collisions)
    {
        int B = 256;
        int[] arrShifts = {3, 5, 6};
        string[] table = new string[B];
        collisions = 0;
        foreach (string town in towns)
        {
            int hash = GetHash(town.ToUpper());
            int i = 0;
            int idx = hash;

            while (table[idx] != null)
            {
                collisions++;
                int shift  = arrShifts[i % 3];
                idx = (idx + shift) % B;
                i++;
            }

            table[idx] = town;
        }
        return table;
    }
}
